lang/python-lib-numpy.org
#+TITLE: numpy 科学计算数组工具集
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2018-10-26 Fri 11:04:00>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+SETUPFILE: ~/.emacs.d/site-lisp/org-html-themes/setup/theme-readtheorg-local.setup
#+TAGS: python numpy tensorflow machine-learning data-processing


* numpy
  numpy 是 Python 科学计算的基础包，主要有以下一些功能：
  1. N 维数组
  2. 线性代数，傅里叶变换等

** 安装测试
   #+BEGIN_SRC sh
     pip install numpy
     python -c 'import numpy; numpy.test()'
   #+END_SRC

** 基本用法
   numpy 的数组类是 =ndarray= ，它的别名是 =array= 。主要 =numpy.array= 和
   Python 自带的 =array.array= 是不同的。

   #+BEGIN_SRC python :exports code
     >>> import numpy as np
     a = np.arange(15).reshape(3, 5)
     >>> a = np.arange(15).reshape(3, 5)
     >>> a
     array([[ 0,  1,  2,  3,  4],
            [ 5,  6,  7,  8,  9],
            [10, 11, 12, 13, 14]])
     >>> a.shape
     (3, 5)
     >>> a.ndim
     2
     >>> a.size
     15
     >>> a.dtype
     dtype('int64')
     >>> a.itemsize
     8
     >>>
     >>> b = np.array([6, 7, 8])
     >>> type(a)
     <class 'numpy.ndarray'>
     >>> type(b)
     <class 'numpy.ndarray'>
     >>>
   #+END_SRC

** 创建数组

   #+BEGIN_SRC python :exports code
     >>> # a = np.array(1, 2, 3, 4)    # WRONG
     ... np.array([1, 2, 3, 4])  # RIGHT
     array([1, 2, 3, 4])
     >>> np.array([(1.5,2,3), (4,5,6)])
     array([[1.5, 2. , 3. ],
            [4. , 5. , 6. ]])
     >>> np.array([ [1,2], [3,4] ], dtype=complex)
     array([[1.+0.j, 2.+0.j],
            [3.+0.j, 4.+0.j]])
   #+END_SRC

** 初始化数组
   #+BEGIN_SRC python :exports code
     >>> np.zeros((3,4))
     array([[0., 0., 0., 0.],
            [0., 0., 0., 0.],
            [0., 0., 0., 0.]])
     >>> np.ones((2,3,4), dtype=np.int16)
     array([[[1, 1, 1, 1],
             [1, 1, 1, 1],
             [1, 1, 1, 1]],

            [[1, 1, 1, 1],
             [1, 1, 1, 1],
             [1, 1, 1, 1]]], dtype=int16)
     >>> np.empty((2,3))
     array([[1.5, 2. , 3. ],
            [4. , 5. , 6. ]])
     >>> np.arange(10, 30, 5) # samillar to range()
     array([10, 15, 20, 25])
     >>> np.arange(1, 2, 0.3) # but accept float
     array([1. , 1.3, 1.6, 1.9])
     >>>
     >>> from numpy import pi
     >>> np.linspace(0, 2, 9)
     array([0.  , 0.25, 0.5 , 0.75, 1.  , 1.25, 1.5 , 1.75, 2.  ])
     >>> x = np.linspace(0, 2*pi, 10)
     >>> y = np.sin(x)
     >>> x
     array([0.        , 0.6981317 , 1.3962634 , 2.0943951 , 2.7925268 ,
            3.4906585 , 4.1887902 , 4.88692191, 5.58505361, 6.28318531])
     >>> y
     array([ 0.00000000e+00,  6.42787610e-01,  9.84807753e-01,  8.66025404e-01,
             3.42020143e-01, -3.42020143e-01, -8.66025404e-01, -9.84807753e-01,
            -6.42787610e-01, -2.44929360e-16])
   #+END_SRC

