lang/python-lib-numpy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-22 Mon 10:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>numpy 科学计算数组工具集</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">numpy 科学计算数组工具集</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org96a6d60">1. numpy</a>
<ul>
<li><a href="#org4f58667">1.1. 安装测试</a></li>
<li><a href="#orga4a067e">1.2. 基本用法</a></li>
<li><a href="#orgc8fcb9a">1.3. 创建数组</a></li>
<li><a href="#orga53732e">1.4. 初始化数组</a></li>
<li><a href="#org058b7fd">1.5. 修改数组维度 reshape</a></li>
<li><a href="#org54ffa7f">1.6. 数学操作</a></li>
<li><a href="#org8dc7c6f">1.7. 深度复制</a></li>
<li><a href="#orgfc46bf0">1.8. 索引</a>
<ul>
<li><a href="#org27e80f5">1.8.1. 使用 Indices 索引</a></li>
<li><a href="#org1af9318">1.8.2. 使用布尔值索引</a></li>
</ul>
</li>
<li><a href="#org27a4d28">1.9. 线性代数</a></li>
<li><a href="#org15d1fc2">1.10. 直方图</a></li>
</ul>
</li>
<li><a href="#orgbf666b2">2. 小技巧: 自动 reshape</a></li>
<li><a href="#org9e701f8">3. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-org96a6d60" class="outline-2">
<h2 id="org96a6d60"><span class="section-number-2">1</span> numpy</h2>
<div class="outline-text-2" id="text-1">
<p>
numpy 是 Python 科学计算的基础包，主要有以下一些功能：
</p>
<ol class="org-ol">
<li>N 维数组</li>
<li>线性代数，傅里叶变换等</li>
</ol>
</div>

<div id="outline-container-org4f58667" class="outline-3">
<h3 id="org4f58667"><span class="section-number-3">1.1</span> 安装测试</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">pip install numpy
python -c <span style="color: #2aa198;">'import numpy; numpy.test()'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4a067e" class="outline-3">
<h3 id="orga4a067e"><span class="section-number-3">1.2</span> 基本用法</h3>
<div class="outline-text-3" id="text-1-2">
<p>
numpy 的数组类是 <code>ndarray</code> ，它的别名是 <code>array</code> 。主要 <code>numpy.array</code> 和
Python 自带的 <code>array.array</code> 是不同的。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #859900;">import</span> numpy <span style="color: #859900;">as</span> np
<span style="color: #6c71c4;">a</span> = np.arange<span style="color: #8d5649;">(</span>15<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>3, 5<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">a</span> = np.arange<span style="color: #8d5649;">(</span>15<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>3, 5<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span> 0,  1,  2,  3,  4<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 5,  6,  7,  8,  9<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>10, 11, 12, 13, 14<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a.shape
<span style="color: #8d5649;">(</span>3, 5<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a.ndim
2
&gt;&gt;&gt; a.size
15
&gt;&gt;&gt; a.dtype
dtype<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'int64'</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a.itemsize
8
&gt;&gt;&gt;
&gt;&gt;&gt; <span style="color: #6c71c4;">b</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>6, 7, 8<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">type</span><span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>
&lt;<span style="color: #859900;">class</span> <span style="color: #2aa198;">'numpy.ndarray'</span>&gt;
&gt;&gt;&gt; <span style="color: #6c71c4;">type</span><span style="color: #8d5649;">(</span>b<span style="color: #8d5649;">)</span>
&lt;<span style="color: #859900;">class</span> <span style="color: #2aa198;">'numpy.ndarray'</span>&gt;
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc8fcb9a" class="outline-3">
<h3 id="orgc8fcb9a"><span class="section-number-3">1.3</span> 创建数组</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">a = np.array(1, 2, 3, 4)    # WRONG</span>
... np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>1, 2, 3, 4<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>  <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">RIGHT</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>1, 2, 3, 4<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">(</span>1.5,2,3<span style="color: #9564bf;">)</span>, <span style="color: #9564bf;">(</span>4,5,6<span style="color: #9564bf;">)</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>1.5, 2. , 3. <span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>4. , 5. , 6. <span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span> <span style="color: #9564bf;">[</span>1,2<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>3,4<span style="color: #9564bf;">]</span> <span style="color: #d8241f;">]</span>, dtype=<span style="color: #6c71c4;">complex</span><span style="color: #8d5649;">)</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>1.+0.j, 2.+0.j<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>3.+0.j, 4.+0.j<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga53732e" class="outline-3">
<h3 id="orga53732e"><span class="section-number-3">1.4</span> 初始化数组</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; np.zeros<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>3,4<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>0., 0., 0., 0.<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>0., 0., 0., 0.<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>0., 0., 0., 0.<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; np.ones<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>2,3,4<span style="color: #d8241f;">)</span>, dtype=np.int16<span style="color: #8d5649;">)</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span><span style="color: #24a222;">[</span>1, 1, 1, 1<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>1, 1, 1, 1<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>1, 1, 1, 1<span style="color: #24a222;">]</span><span style="color: #9564bf;">]</span>,

       <span style="color: #9564bf;">[</span><span style="color: #24a222;">[</span>1, 1, 1, 1<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>1, 1, 1, 1<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>1, 1, 1, 1<span style="color: #24a222;">]</span><span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span>, dtype=int16<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; np.empty<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>2,3<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>1.5, 2. , 3. <span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>4. , 5. , 6. <span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; np.arange<span style="color: #8d5649;">(</span>10, 30, 5<span style="color: #8d5649;">)</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">samillar to range()</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>10, 15, 20, 25<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; np.arange<span style="color: #8d5649;">(</span>1, 2, 0.3<span style="color: #8d5649;">)</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">but accept float</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>1. , 1.3, 1.6, 1.9<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt;
&gt;&gt;&gt; <span style="color: #859900;">from</span> numpy <span style="color: #859900;">import</span> pi
&gt;&gt;&gt; np.linspace<span style="color: #8d5649;">(</span>0, 2, 9<span style="color: #8d5649;">)</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>0.  , 0.25, 0.5 , 0.75, 1.  , 1.25, 1.5 , 1.75, 2.  <span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">x</span> = np.linspace<span style="color: #8d5649;">(</span>0, 2*pi, 10<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">y</span> = np.sin<span style="color: #8d5649;">(</span>x<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; x
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>0.        , 0.6981317 , 1.3962634 , 2.0943951 , 2.7925268 ,
       3.4906585 , 4.1887902 , 4.88692191, 5.58505361, 6.28318531<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; y
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span> 0.00000000e+00,  6.42787610e-01,  9.84807753e-01,  8.66025404e-01,
        3.42020143e-01, -3.42020143e-01, -8.66025404e-01, -9.84807753e-01,
       -6.42787610e-01, -2.44929360e-16<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>
