lang/python-lib-numpy.org
** 修改数组维度 reshape

   #+BEGIN_SRC python :exports code
     >>> np.arange(6)
     array([0, 1, 2, 3, 4, 5])
     >>> np.arange(12).reshape(4,3)
     array([[ 0,  1,  2],
            [ 3,  4,  5],
            [ 6,  7,  8],
            [ 9, 10, 11]])
     >>> np.arange(24).reshape(2,3,4)
     array([[[ 0,  1,  2,  3],
             [ 4,  5,  6,  7],
             [ 8,  9, 10, 11]],

            [[12, 13, 14, 15],
             [16, 17, 18, 19],
             [20, 21, 22, 23]]])
     >>>
   #+END_SRC

** 数学操作
   numpy 重载了 Python 的数学操作符，基本操作如下

   #+BEGIN_SRC python :exports code
     >>> a = np.array( [20,30,40,50] )
     >>> b = np.arange(4)
     >>> c = a-b
     >>> b**2
     array([0, 1, 4, 9])
     >>> 10*np.sin(a)
     array([ 9.12945251, -9.88031624,  7.4511316 , -2.62374854])
     >>> a<35
     array([ True,  True, False, False])
   #+END_SRC

   矩阵的乘法和矩阵里面每个元素相乘

   #+BEGIN_SRC python :exports code
     >>> A = np.array([[1,1],
     ...               [0,1]] )
     >>> B = np.array([[2,0],
     ...               [3,4]] )
     >>> A * B                       # elementwise product
     array([[2, 0],
            [0, 4]])
     >>> A @ B                       # matrix product
     array([[5, 4],
            [3, 4]])
     >>> A.dot(B)                    # another matrix product
     array([[5, 4],
            [3, 4]])
     >>>
   #+END_SRC

   #+BEGIN_SRC python :exports code
     >>> a = np.random.random((2,3))
     >>> a
     array([[0.54468729, 0.03709586, 0.65467565],
            [0.56025666, 0.39270547, 0.51565504]])
     >>> a.sum()
     2.705075965630731
     >>> a.min()
     0.037095859583547
     >>> a.max()
     0.6546756487343482
     >>>
   #+END_SRC

** 深度复制
   #+BEGIN_SRC python :exports code
     >>> a
     array([[0.54468729, 0.03709586, 0.65467565],
            [0.56025666, 0.39270547, 0.51565504]])
     >>> d = a.copy()                          # a new array object with new data is created
     >>> d is a
     False
     >>> d.base is a                           # d doesn't share anything with a
     False
     >>> d[0,0] = 9999
     >>> d
     array([[9.99900000e+03, 3.70958596e-02, 6.54675649e-01],
            [5.60256661e-01, 3.92705465e-01, 5.15655039e-01]])
     >>> a
     array([[0.54468729, 0.03709586, 0.65467565],
            [0.56025666, 0.39270547, 0.51565504]])
     >>>
   #+END_SRC

** 索引
