lang/python-lib-numpy.html

<div id="outline-container-org058b7fd" class="outline-3">
<h3 id="org058b7fd"><span class="section-number-3">1.5</span> 修改数组维度 reshape</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; np.arange<span style="color: #8d5649;">(</span>6<span style="color: #8d5649;">)</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>0, 1, 2, 3, 4, 5<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; np.arange<span style="color: #8d5649;">(</span>12<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>4,3<span style="color: #8d5649;">)</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span> 0,  1,  2<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 3,  4,  5<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 6,  7,  8<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 9, 10, 11<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; np.arange<span style="color: #8d5649;">(</span>24<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>2,3,4<span style="color: #8d5649;">)</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span><span style="color: #24a222;">[</span> 0,  1,  2,  3<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span> 4,  5,  6,  7<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span> 8,  9, 10, 11<span style="color: #24a222;">]</span><span style="color: #9564bf;">]</span>,

       <span style="color: #9564bf;">[</span><span style="color: #24a222;">[</span>12, 13, 14, 15<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>16, 17, 18, 19<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>20, 21, 22, 23<span style="color: #24a222;">]</span><span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org54ffa7f" class="outline-3">
<h3 id="org54ffa7f"><span class="section-number-3">1.6</span> 数学操作</h3>
<div class="outline-text-3" id="text-1-6">
<p>
numpy 重载了 Python 的数学操作符，基本操作如下
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">a</span> = np.array<span style="color: #8d5649;">(</span> <span style="color: #d8241f;">[</span>20,30,40,50<span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">b</span> = np.arange<span style="color: #8d5649;">(</span>4<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">c</span> = a-b
&gt;&gt;&gt; b**2
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>0, 1, 4, 9<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; 10*np.sin<span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span> 9.12945251, -9.88031624,  7.4511316 , -2.62374854<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a&lt;35
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span> <span style="color: #268bd2;">True</span>,  <span style="color: #268bd2;">True</span>, <span style="color: #268bd2;">False</span>, <span style="color: #268bd2;">False</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<p>
矩阵的乘法和矩阵里面每个元素相乘
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">A</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>1,1<span style="color: #9564bf;">]</span>,
...               <span style="color: #9564bf;">[</span>0,1<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">B</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>2,0<span style="color: #9564bf;">]</span>,
...               <span style="color: #9564bf;">[</span>3,4<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>
&gt;&gt;&gt; A * B                       <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">elementwise product</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>2, 0<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>0, 4<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; A @ B                       <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">matrix product</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>5, 4<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>3, 4<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; A.dot<span style="color: #8d5649;">(</span>B<span style="color: #8d5649;">)</span>                    <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">another matrix product</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>5, 4<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>3, 4<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">a</span> = np.random.random<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>2,3<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>0.54468729, 0.03709586, 0.65467565<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>0.56025666, 0.39270547, 0.51565504<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a.<span style="color: #6c71c4;">sum</span><span style="color: #8d5649;">()</span>
2.705075965630731
&gt;&gt;&gt; a.<span style="color: #6c71c4;">min</span><span style="color: #8d5649;">()</span>
0.037095859583547
&gt;&gt;&gt; a.<span style="color: #6c71c4;">max</span><span style="color: #8d5649;">()</span>
0.6546756487343482
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8dc7c6f" class="outline-3">
<h3 id="org8dc7c6f"><span class="section-number-3">1.7</span> 深度复制</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; a
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>0.54468729, 0.03709586, 0.65467565<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>0.56025666, 0.39270547, 0.51565504<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">d</span> = a.copy<span style="color: #8d5649;">()</span>                          <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">a new array object with new data is created</span>
&gt;&gt;&gt; d <span style="color: #859900;">is</span> a
<span style="color: #268bd2;">False</span>
&gt;&gt;&gt; d.base <span style="color: #859900;">is</span> a                           <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">d doesn't share anything with a</span>
<span style="color: #268bd2;">False</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">d</span><span style="color: #8d5649;">[</span>0,0<span style="color: #8d5649;">]</span> = 9999
&gt;&gt;&gt; d
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>9.99900000e+03, 3.70958596e-02, 6.54675649e-01<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>5.60256661e-01, 3.92705465e-01, 5.15655039e-01<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>0.54468729, 0.03709586, 0.65467565<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>0.56025666, 0.39270547, 0.51565504<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
