lang/python-lib-numpy.html

<div id="outline-container-orgfc46bf0" class="outline-3">
<h3 id="orgfc46bf0"><span class="section-number-3">1.8</span> 索引</h3>
<div class="outline-text-3" id="text-1-8">
</div>
<div id="outline-container-org27e80f5" class="outline-4">
<h4 id="org27e80f5"><span class="section-number-4">1.8.1</span> 使用 Indices 索引</h4>
<div class="outline-text-4" id="text-1-8-1">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">a</span> = np.arange<span style="color: #8d5649;">(</span>12<span style="color: #8d5649;">)</span>**2                       <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">the first 12 square numbers</span>
&gt;&gt;&gt; a
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>  0,   1,   4,   9,  16,  25,  36,  49,  64,  81, 100, 121<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">i</span> = np.array<span style="color: #8d5649;">(</span> <span style="color: #d8241f;">[</span> 1,1,3,8,5 <span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>              <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">an array of indices</span>
&gt;&gt;&gt; a<span style="color: #8d5649;">[</span>i<span style="color: #8d5649;">]</span>                                <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">the elements of a at the positions i</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span> 1,  1,  9, 64, 25<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">j</span> = np.array<span style="color: #8d5649;">(</span> <span style="color: #d8241f;">[</span> <span style="color: #9564bf;">[</span> 3, 4<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span> 9, 7 <span style="color: #9564bf;">]</span> <span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>      <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">a bidimensional array of indices</span>
&gt;&gt;&gt; a<span style="color: #8d5649;">[</span>j<span style="color: #8d5649;">]</span>                                <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">the same shape as j</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span> 9, 16<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>81, 49<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt;
</pre>
</div>

<p>
使用下标来掩码
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">palette</span> = np.array<span style="color: #8d5649;">(</span> <span style="color: #d8241f;">[</span> <span style="color: #9564bf;">[</span>0,0,0<span style="color: #9564bf;">]</span>,            <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">black</span>
...                       <span style="color: #9564bf;">[</span>255,0,0<span style="color: #9564bf;">]</span>,          <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">red</span>
...                       <span style="color: #9564bf;">[</span>0,255,0<span style="color: #9564bf;">]</span>,          <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">green</span>
...                       <span style="color: #9564bf;">[</span>0,0,255<span style="color: #9564bf;">]</span>,          <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">blue</span>
...                       <span style="color: #9564bf;">[</span>255,255,255<span style="color: #9564bf;">]</span> <span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>   <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">white</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">image</span> = np.array<span style="color: #8d5649;">(</span> <span style="color: #d8241f;">[</span> <span style="color: #9564bf;">[</span> 0, 1, 2, 0 <span style="color: #9564bf;">]</span>,       <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">each value corresponds to a color in the palette</span>
...                     <span style="color: #9564bf;">[</span> 0, 3, 4, 0 <span style="color: #9564bf;">]</span>  <span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>
&gt;&gt;&gt; palette<span style="color: #8d5649;">[</span>image<span style="color: #8d5649;">]</span>                            <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">the (2,4,3) color image</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span><span style="color: #24a222;">[</span>  0,   0,   0<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>255,   0,   0<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>  0, 255,   0<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>  0,   0,   0<span style="color: #24a222;">]</span><span style="color: #9564bf;">]</span>,

       <span style="color: #9564bf;">[</span><span style="color: #24a222;">[</span>  0,   0,   0<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>  0,   0, 255<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>255, 255, 255<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>  0,   0,   0<span style="color: #24a222;">]</span><span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">a</span> = np.arange<span style="color: #8d5649;">(</span>12<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>3,4<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">i</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span> <span style="color: #9564bf;">[</span>0,1<span style="color: #9564bf;">]</span>,                  <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">indices for the first dim of a</span>
...                <span style="color: #9564bf;">[</span>1,2<span style="color: #9564bf;">]</span> <span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">j</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span> <span style="color: #9564bf;">[</span>2,1<span style="color: #9564bf;">]</span>,                  <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">indices for the second dim</span>
...                <span style="color: #9564bf;">[</span>3,3<span style="color: #9564bf;">]</span> <span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a<span style="color: #8d5649;">[</span>i,j<span style="color: #8d5649;">]</span>                                 <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">i and j must have equal shape</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span> 2,  5<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 7, 11<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a<span style="color: #8d5649;">[</span>i,2<span style="color: #8d5649;">]</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span> 2,  6<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 6, 10<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a<span style="color: #8d5649;">[</span>:,j<span style="color: #8d5649;">]</span>                                 <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">i.e., a[ : , j]</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span><span style="color: #24a222;">[</span> 2,  1<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span> 3,  3<span style="color: #24a222;">]</span><span style="color: #9564bf;">]</span>,

       <span style="color: #9564bf;">[</span><span style="color: #24a222;">[</span> 6,  5<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span> 7,  7<span style="color: #24a222;">]</span><span style="color: #9564bf;">]</span>,

       <span style="color: #9564bf;">[</span><span style="color: #24a222;">[</span>10,  9<span style="color: #24a222;">]</span>,
        <span style="color: #24a222;">[</span>11, 11<span style="color: #24a222;">]</span><span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
