lang/python-lib-numpy.org
*** 使用布尔值索引

    #+BEGIN_SRC python :exports code
      >>> a = np.arange(12).reshape(3,4)
      >>> b = a > 4
      >>> b                        # b is a boolean with a's shape
      array([[False, False, False, False],
             [False,  True,  True,  True],
             [ True,  True,  True,  True]])
      >>> a[b]                     # 1d array with the selected elements
      array([ 5,  6,  7,  8,  9, 10, 11])
      >>> a[b] = 0                 # All elements of 'a' higher than 4 become 0
      >>> a
      array([[0, 1, 2, 3],
             [4, 0, 0, 0],
             [0, 0, 0, 0]])
      >>>
    #+END_SRC

    多个维度的索引
    #+BEGIN_SRC python :exports code
      >>> a = np.arange(12).reshape(3,4)
      >>> a
      array([[ 0,  1,  2,  3],
             [ 4,  5,  6,  7],
             [ 8,  9, 10, 11]])
      >>> b1 = np.array([False,True,True])          # first dim selection
      >>> b2 = np.array([True,False,True,False])    # second dim selection
      >>> a[b1,:]                                   # selecting rows
      array([[ 4,  5,  6,  7],
             [ 8,  9, 10, 11]])
      >>> a[b1]                                     # same thing
      array([[ 4,  5,  6,  7],
             [ 8,  9, 10, 11]])
      >>> a[:,b2]                                   # selecting columns
      array([[ 0,  2],
             [ 4,  6],
             [ 8, 10]])
      >>> a[b1,b2]                                  # a weird thing to do
      array([ 4, 10])
      >>>
    #+END_SRC

** 线性代数

   #+BEGIN_SRC python :exports code
  a = np.array([[1.0, 2.0], [3.0, 4.0]])
  a.transpose()
  np.linalg.inv(a)
  u = np.eye(2) # unit 2x2 matrix; "eye" represents "I"
  j = np.array([[0.0, -1.0], [1.0, 0.0]])
  j @ j        # matrix product
  np.trace(u)  # trace
  y = np.array([[5.], [7.]])
  np.linalg.solve(a, y)
  np.linalg.eig(j)
   #+END_SRC

