lang/python-lib-numpy.html

<div id="outline-container-org1af9318" class="outline-4">
<h4 id="org1af9318"><span class="section-number-4">1.8.2</span> 使用布尔值索引</h4>
<div class="outline-text-4" id="text-1-8-2">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">a</span> = np.arange<span style="color: #8d5649;">(</span>12<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>3,4<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">b</span> = a &gt; 4
&gt;&gt;&gt; b                        <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">b is a boolean with a's shape</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span><span style="color: #268bd2;">False</span>, <span style="color: #268bd2;">False</span>, <span style="color: #268bd2;">False</span>, <span style="color: #268bd2;">False</span><span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span><span style="color: #268bd2;">False</span>,  <span style="color: #268bd2;">True</span>,  <span style="color: #268bd2;">True</span>,  <span style="color: #268bd2;">True</span><span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> <span style="color: #268bd2;">True</span>,  <span style="color: #268bd2;">True</span>,  <span style="color: #268bd2;">True</span>,  <span style="color: #268bd2;">True</span><span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a<span style="color: #8d5649;">[</span>b<span style="color: #8d5649;">]</span>                     <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">1d array with the selected elements</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span> 5,  6,  7,  8,  9, 10, 11<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">a</span><span style="color: #8d5649;">[</span>b<span style="color: #8d5649;">]</span> = 0                 <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">All elements of 'a' higher than 4 become 0</span>
&gt;&gt;&gt; a
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>0, 1, 2, 3<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>4, 0, 0, 0<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span>0, 0, 0, 0<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt;
</pre>
</div>

<p>
多个维度的索引
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #6c71c4;">a</span> = np.arange<span style="color: #8d5649;">(</span>12<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>3,4<span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span> 0,  1,  2,  3<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 4,  5,  6,  7<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 8,  9, 10, 11<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">b1</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #268bd2;">False</span>,<span style="color: #268bd2;">True</span>,<span style="color: #268bd2;">True</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>          <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">first dim selection</span>
&gt;&gt;&gt; <span style="color: #6c71c4;">b2</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #268bd2;">True</span>,<span style="color: #268bd2;">False</span>,<span style="color: #268bd2;">True</span>,<span style="color: #268bd2;">False</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>    <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">second dim selection</span>
&gt;&gt;&gt; a<span style="color: #8d5649;">[</span>b1,:<span style="color: #8d5649;">]</span>                                   <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">selecting rows</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span> 4,  5,  6,  7<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 8,  9, 10, 11<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a<span style="color: #8d5649;">[</span>b1<span style="color: #8d5649;">]</span>                                     <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">same thing</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span> 4,  5,  6,  7<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 8,  9, 10, 11<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a<span style="color: #8d5649;">[</span>:,b2<span style="color: #8d5649;">]</span>                                   <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">selecting columns</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span> 0,  2<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 4,  6<span style="color: #9564bf;">]</span>,
       <span style="color: #9564bf;">[</span> 8, 10<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt; a<span style="color: #8d5649;">[</span>b1,b2<span style="color: #8d5649;">]</span>                                  <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">a weird thing to do</span>
array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span> 4, 10<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org27a4d28" class="outline-3">
<h3 id="org27a4d28"><span class="section-number-3">1.9</span> 线性代数</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">a</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>1.0, 2.0<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>3.0, 4.0<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
a.transpose<span style="color: #8d5649;">()</span>
np.linalg.inv<span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">u</span> = np.eye<span style="color: #8d5649;">(</span>2<span style="color: #8d5649;">)</span> <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">unit 2x2 matrix; "eye" represents "I"</span>
<span style="color: #6c71c4;">j</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>0.0, -1.0<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>1.0, 0.0<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
j @ j        <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">matrix product</span>
np.trace<span style="color: #8d5649;">(</span>u<span style="color: #8d5649;">)</span>  <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">trace</span>
<span style="color: #6c71c4;">y</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>5.<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>7.<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
np.linalg.solve<span style="color: #8d5649;">(</span>a, y<span style="color: #8d5649;">)</span>
np.linalg.eig<span style="color: #8d5649;">(</span>j<span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>
